Revit 2027 API
CompoundStructure.GetSegmentIds Method
 Gets the segment ids of this compound structure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetSegmentIds()
Public Function GetSegmentIds As IList(Of Integer)
public:
IList<int>^ GetSegmentIds()
member GetSegmentIds : unit -> IList<int>
Return Value
IList<Int32>
 The ids of the segments which form the boundary of the regions of this CompoundStructure.
Exceptions
Exception | Condition
InvalidOperationException |  This operation is valid only for vertically compound structures.
Remarks
 The boundaries of the regions of a vertically compound structure consist of vertical horizontal segments with unique ids.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace